---
kind: method
id: M:Autodesk.Revit.DB.PolyLine.GetTransformed(Autodesk.Revit.DB.Transform)
zh: 多段线、折线
source: html/0e43fcbd-951e-611a-8ddb-f866554fe8ac.htm
---
# Autodesk.Revit.DB.PolyLine.GetTransformed Method

**中文**: 多段线、折线

Gets the copy of the polyline which is applied the specified transformation.

## Syntax (C#)
```csharp
public PolyLine GetTransformed(
	Transform transform
)
```

## Parameters
- **transform** (`Autodesk.Revit.DB.Transform`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the transform is Nothing nullptr a null reference ( Nothing in Visual Basic) .